000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-2.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 COUNTER PIC 9(3) VALUE IS 0.
000700 01 DEMO-A  PIC S9(2)V9(2) VALUE IS 99.

000800 PROCEDURE DIVISION.
000900 DISPLAY 'my name is kevin'.
001000*THIS IS A COMMENT

